Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This chapter provides just enough information to edit a file with Vim. Not well or fast, but you can edit. Take some time to practice with these commands, they form the base for what follows.
es_es: Este capítulo ofrece suficiente información para editar un archivo con Vim. No bien ni rápido, pero podrá editar. Tómese un tiempo para practicar estas órdenes, son la base de lo que sigue.

source: |02.1| Running Vim for the First Time |02.2| Inserting text |02.3| Moving around |02.4| Deleting characters |02.5| Undo and Redo |02.6| Other editing commands |02.7| Getting out |02.8| Finding help
es_es: |02.1| Ejecutar Vim por primera vez |02.2| Insertar texto |02.3| Movimiento |02.4| Eliminar caracteres |02.5| Deshacer y rehacer |02.6| Otras órdenes de edición |02.7| Salir |02.8| Encontrar ayuda

source: Next chapter: |usr_03.txt| Moving around Previous chapter: |usr_01.txt| About the manuals Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_03.esx| Desplazamiento Capítulo anterior: |usr_01.esx| Acerca de los manuales Tabla de contenidos: |usr_toc.esx|

source: *02.1* Running Vim for the First Time
es_es: *02.1* Ejecutar Vim por primera vez

source: In UNIX you can type this at any command prompt. If you are running Microsoft Windows, open an MS-DOS prompt window and enter the command. In either case, Vim starts editing a file called file.txt. Because this is a new file, you get a blank window. This is what your screen will look like:
es_es: En UNIX puede introducir esta orden en cualquier interprete de órdenes. Si está bajo Microsoft Windows, abra una terminal de MS-DOS e introduzca la orden. En ambos casos, Vim se inicia con la edición de un archivo llamado file.txt. Ya que es un archivo nuevo, obtendrá un ventana vacía. Así es como su pantalla debería aparecer:

source: +---------------------------------------+ |# | |~ | |~ | |~ | |~ | |"file.txt" [New file] | +---------------------------------------+ ('#" is the cursor position.)
es_es: +---------------------------------------+ |# | |~ | |~ | |~ | |~ | |"file.txt" [Archivo nuevo] | +---------------------------------------+ ('#" es la posición del cursor.)

source: The tilde (~) lines indicate lines not in the file. In other words, when Vim runs out of file to display, it displays tilde lines. At the bottom of the screen, a message line indicates the file is named file.txt and shows that you are creating a new file. The message information is temporary and other information overwrites it.
es_es: Las líneas con tilde (~) indican líneas que no se hallan en el archivo. En otras palabras, cuando Vim se queda sin archivo que mostrar muestra líneas con tilde. En la parte inferior de la pantalla, un mensaje muestra que el archivo se llama file.txt y que está creando un archivo nuevo. La información del mensaje es temporal y otra información la sobreescribirá.

source: The gvim command causes the editor to create a new window for editing. If you use this command: >
es_es: La orden «gvim» hace que el editor cree una nueva ventana para editar. Si usa la orden: >

source: the editing occurs inside your command window. In other words, if you are running inside an xterm, the editor uses your xterm window. If you are using an MS-DOS command prompt window under Microsoft Windows, the editing occurs inside this window. The text in the window will look the same for both versions, but with gvim you have extra features, like a menu bar. More about that later.
es_es: la edición ocurre dentro de la ventana de llamada. En otras palabras, si está dentro de una xterm, el editor usa su ventana xterm. Si está usando una terminal de MS-DOS bajo Windows, la edición tendrá lugar dentro de esta ventana. El texto en la ventana tendrá el mismo aspecto en ambas versiones, pero con gvim tiene características extra, como una barra de menú. Volveremos a este punto posteriormente.

source: *02.2* Inserting text
es_es: *02.2* Insertar texto

source: After typing "turtle" you press the <Enter> key to start a new line. Finally you press the <Esc> key to stop Insert mode and go back to Normal mode. You now have two lines of text in your Vim window:
es_es: Tras teclear «turtle», pulse la tecla <Intro> para comenzar una nueva línea. Por último, presione la tecla <Esc> para salir del modo Insertar y volver al modo Normal. Ahora tienes dos línea de texto en su ventana de Vim:

source: You will notice that when typing the colon Vim moves the cursor to the last line of the window. That's where you type colon commands (commands that start with a colon). Finish this command by pressing the <Enter> key (all commands that start with a colon are finished this way). Now, if you type the "i" command Vim will display --INSERT-- at the bottom of the window. This indicates you are in Insert mode.
es_es: Comprobará que cuando introduce dos puntos, Vim desplaza el cursor a la última línea de la ventana. Allí es donde introducirá órdenes con dos puntos (órdenes que comienzan con dos puntos). Finalice la orden presionando la tecla <Intro> (todas estas órdenes se finalizan de este modo). Si pulsase ahora la orden «i», Vim mostrará --INSERT-- en la parte inferior de la ventana. Esto indica que está en el modo Insertar.

source: One of the problems for Vim novices is mode confusion, which is caused by forgetting which mode you are in or by accidentally typing a command that switches modes. To get back to Normal mode, no matter what mode you are in, press the <Esc> key. Sometimes you have to press it twice. If Vim beeps back at you, you already are in Normal mode.
es_es: Uno de los problemas para los que comienzan a usar Vim es la confusión de los modos, que se produce al olvidar en qué modo está o por teclear accidentalmente una orden que cambia de modo. Para volver al modo Normal, no importa el modo en el que esté,presione la tecla <Esc>. En algunas ocasiones, tendrá que presionarlo dos veces. Si Vim emite un pitido, entonces es que está de vuelta al modo Normal.

source: *02.3* Moving around
es_es: *02.3* Movimiento

source: h left *hjkl* j down k up l right
es_es: h izquierda *hjkl* j abajo k arriba l derecha

source: At first, it may appear that these commands were chosen at random. After all, who ever heard of using l for right? But actually, there is a very good reason for these choices: Moving the cursor is the most common thing you do in an editor, and these keys are on the home row of your right hand. In other words, these commands are placed where you can type them the fastest (especially when you type with ten fingers).
es_es: En un principio, puede parecer que estas órdenes se han elegido arbitrariamente. Después de todo, ¿quién ha visto usar l para derecha? De hecho, hay una buena razón para esto: mover el cursor es una de las cosas más comunes que hará en un editor, y estas teclas están en la fila central de su mano derecha. En otras palabras, estas órdenes se sitúan donde puede teclearlos de manera más rápida (especialmente cuando escribe con diez dedos).

source: Note: You can also move the cursor by using the arrow keys. If you do, however, you greatly slow down your editing because to press the arrow keys, you must move your hand from the text keys to the arrow keys. Considering that you might be doing it hundreds of times an hour, this can take a significant amount of time. Also, there are keyboards which do not have arrow keys, or which locate them in unusual places; therefore, knowing the use of the hjkl keys helps in those situations.
es_es: Nota: También puede mover el cursor usando las flechas. Si lo haces, sin embargo, ralentizará considerablemente la edición, ya que para ello tendrá que desplazar su mano desde las letras a las flechas del teclado. Teniendo en cuenta que debe hacerlo cientos de veces cada hora, esto puede llevar un tiempo considerable. Además, hay teclados que no tienen teclas de flechas, o que las colocan en lugares inusuales; por lo tanto, conocer el uso de hjkl ayuda en esas situaciones.

source: One way to remember these commands is that h is on the left, l is on the right and j points down. In a picture: >
es_es: Una manera de recordar estas órdenes es que la h está a la izquierda, l en la derecha y j apunta hacia abajo. En un esquema: >

source: The best way to learn these commands is by using them. Use the "i" command to insert some more lines of text. Then use the hjkl keys to move around and insert a word somewhere. Don't forget to press <Esc> to go back to Normal mode. The |vimtutor| is also a nice way to learn by doing.
es_es: La mejor manera de aprender estas órdenes es usándolas. Use la orden «i» para insertar algunas líneas de texto más. Use entonces las teclas hjkl para moverse e insertar palabras. No se olvide de presionar <Esc> para volver al modo Normal. El |vimtutor| es también una práctica manera de aprender.

source: Komsomolsk ^ | Huan Ho <--- ---> Los Angeles (Yellow river) | v Java (the island, not the programming language)
es_es: Komsomolsk ^ | Huan Ho <--- ---> Los Angeles (Río amarillo) | v Java (la isla, no el lenguaje de programación)

source: *02.4* Deleting characters
es_es: *02.4* Eliminar caracteres

source: To delete a character, move the cursor over it and type "x". (This is a throwback to the old days of the typewriter, when you deleted things by typing xxxx over them.) Move the cursor to the beginning of the first line, for example, and type xxxxxxx (seven x's) to delete "A very ". The result should look like this:
es_es: Para eliminar un carácter, sitúe el cursor encima de él y presione «x». (Esto es una reminiscencia de los días de las máquinas de escribir, cuando se eliminaban caracteres escribiendo xxxx sobre ellos.) Sitúe el cursor al comienzo de la primera línea, por ejemplo, y pulse xxxxxxx (siete «xx») para eliminar «A very». El resultado debería ser:

source: This begins an insert (the i), inserts the words "A young", and then exits insert mode (the final <Esc>). The result:
es_es: Esto inicia una inserción (la «i»), inserta las palabras «A young», y sale del modo insertar (el <Esc> final). El resultado:

source: To delete a whole line use the "dd" command. The following line will then move up to fill the gap:
es_es: Para eliminar una línea entera use la orden «dd». La siguiente línea se moverá hacia arriba para rellenar el hueco:

source: In Vim you can join two lines together, which means that the line break between them is deleted. The "J" command does this. Take these two lines:
es_es: En Vim puede unir dos líneas, lo que significa que el salto de línea entre ellas se elimina. La orden «J» hace esto. Suponga estas dos líneas:

source: *02.5* Undo and Redo
es_es: *02.5* Deshacer y rehacer

source: Suppose you delete too much. Well, you can type it in again, but an easier way exists. The "u" command undoes the last edit. Take a look at this in action: After using "dd" to delete the first line, "u" brings it back. Another one: Move the cursor to the A in the first line:
es_es: Suponga que elimina demasiado. Puede teclearlo de nuevo, pero existe una manera más fácil. La orden «u» deshace la última edición. Vea esto en acción: Tras usar «dd» para eliminar la última línea, «u» la devuelve. Otra más: mueve el cursor a la A en la primera línea:

source: Now type xxxxxxx to delete "A young". The result is as follows:
es_es: Ahora teclee xxxxxxx para eliminar «A young». El resultado es el siguiente:

source: Type "u" to undo the last delete. That delete removed the g, so the undo restores the character.
es_es: Teclee «u» para deshacer la última eliminación. Esa última eliminación quitó la g, por lo que deshacer la devuelve.

source: Note: If you type "u" twice, and the result is that you get the same text back, you have Vim configured to work Vi compatible. Look here to fix this: |not-compatible|. This text assumes you work "The Vim Way". You might prefer to use the good old Vi way, but you will have to watch out for small differences in the text then.
es_es: Nota: Si teclea la «u» dos veces, y el resultado que obtendrá es el mismo texto de vuelta, es que tiene Vim configurado para que sea Vi-compatible. Véase aquí para solucionarlo: |not-compatible|. Este texto asume que trabaja en «El Modo Vim». Quizá quiera usar el viejo modo Vi, pero entonces tendrá que observar las pequeñas diferencias.

source: If you undo too many times, you can press CTRL-R (redo) to reverse the preceding command. In other words, it undoes the undo. To see this in action, press CTRL-R twice. The character A and the space after it disappear:
es_es: Si deshace de más, puede pulsar CTRL-R (rehacer) para revertir la orden precedente. En otras palabras, deshace el deshacer. Para ver esto en acción, presione CTRL-R dos veces. El carácter A y el espacio desaparecerían:

source: There's a special version of the undo command, the "U" (undo line) command. The undo line command undoes all the changes made on the last line that was edited. Typing this command twice cancels the preceding "U".
es_es: Hay una versión especial de la orden deshacer, la orden «U» (deshacer línea). La orden deshacer línea deshace todos los cambios realizados en la última línea editada. Si teclea esta orden dos veces, deshará la «U» precedente.

source: A very intelligent turtle ~ xxxx Delete very
es_es: A very intelligent turtle ~ xxxx Eliminar very

source: A intelligent turtle ~ xxxxxx Delete turtle
es_es: A intelligent turtle ~ xxxxxx Eliminar turtle

source: A intelligent ~ Restore line with "U" A very intelligent turtle ~ Undo "U" with "u" A intelligent ~
es_es: A intelligent ~ Restaurar línea con «U» A very intelligent turtle ~ Deshacer «U» con «u» A intelligent ~

source: The "U" command is a change by itself, which the "u" command undoes and CTRL-R redoes. This might be a bit confusing. Don't worry, with "u" and CTRL-R you can go to any of the situations you had. More about that in section |32.2|.
es_es: La orden «U» es un cambio en sí mismo, que la orden «u» deshace y CTRL-R rehace. Esto puede resultar confuso. No se preocupe, con «u» y CTRL-R puede ir a cualquier situación anterior. Más información en la sección |32.2|.

source: *02.6* Other editing commands
es_es: *02.6* Otras órdenes de edición

source: Vim has a large number of commands to change the text. See |Q_in| and below. Here are a few often used ones.
es_es: Vim tiene una larga lista de órdenes para modificar texto. Véase |Q_in| y a continuación. Aquí hay algunos de uso frecuente.

source: The "i" command inserts a character before the character under the cursor. That works fine; but what happens if you want to add stuff to the end of the line? For that you need to insert text after the cursor. This is done with the "a" (append) command. For example, to change the line
es_es: La orden «i» inserta un carácter antes del carácter bajo el cursor. Esto funciona bien; pero ¿qué ocurre si quieres añadir algo al final de la línea? Para ello necesita insertar texto después del cursor. Esto se hace con la orden «a» (añadir). Por ejemplo, para modificar la línea

source: and that's not saying much for the turtle. ~ to and that's not saying much for the turtle!!! ~
es_es: and that's not saying much for the turtle. ~ a and that's not saying much for the turtle!!! ~

source: The "o" command creates a new, empty line below the cursor and puts Vim in Insert mode. Then you can type the text for the new line. Suppose the cursor is somewhere in the first of these two lines:
es_es: La orden «o» crea una nueva línea vacía debajo del cursor y pone Vim en modo insertar. Puede introducir el texto de la nueva línea. Suponga que el cursor está en algún lugar de la primera de estas líneas:

source: The result is:
es_es: El resultado es:

source: Suppose you want to move up nine lines. You can type "kkkkkkkkk" or you can enter the command "9k". In fact, you can precede many commands with a number. Earlier in this chapter, for instance, you added three exclamation points to the end of a line by typing "a!!!<Esc>". Another way to do this is to use the command "3a!<Esc>". The count of 3 tells the command that follows to triple its effect. Similarly, to delete three characters, use the command "3x". The count always comes before the command it applies to.
es_es: Suponga que quiera desplazarse nueve líneas hacia arriba. Puede teclear «kkkkkkkkk» o puede teclear la orden «9k». De hecho, se puede emplear el multiplicador con muchas órdenes. Anteriormente en este capítulo, añadió tres exclamaciones al final de la línea con «a!!!<Esc>». Otra forma de hacer esto es usar la orden «3a!<Esc>». El multiplicador 3 hace que la orden a continuación triplique su efecto. De igual modo, para eliminar tres caracteres, use «3x». El multiplicador siempre va delante de la orden sobre el que se aplica.

source: *02.7* Getting out
es_es: *02.7* Salir

source: To exit, use the "ZZ" command. This command writes the file and exits.
es_es: Para salir, use la orden «ZZ». Esta orden escribe el archivo y sale.

source: Note: Unlike many other editors, Vim does not automatically make a backup file. If you type "ZZ", your changes are committed and there's no turning back. You can configure the Vim editor to produce backup files, see |07.4|.
es_es: Nota: Al revés que muchos otros editores, Vim no hace un archivo de seguridad automático. Si escribe «ZZ», sus cambios se comprometen sin vuelta atrás. Puede configurar el editor Vim para que haga copias de seguridad, consulte |07.4|.

source: Sometimes you will make a sequence of changes and suddenly realize you were better off before you started. Not to worry; Vim has a quit-and-throw-things-away command. It is: >
es_es: En ocasiones se dará cuenta de que tras una serie de cambios, estaba mejor donde comenzó. No se preocupe; Vim tiene una orden para salir y descartar todos los cambios. Es: >

source: For those of you interested in the details, the three parts of this command are the colon (:), which enters Command-line mode; the q command, which tells the editor to quit; and the override command modifier (!). The override command modifier is needed because Vim is reluctant to throw away changes. If you were to just type ":q", Vim would display an error message and refuse to exit:
es_es: Para aquellos de vosotros interesados en los detalles, las tres partes de esta orden son los dos puntos (:), que entra en el modo en línea de órdenes; la orden «q», para salir; y el modificador de anulación (!). El modificador de anulación es necesario porque Vim se resiste a perder los cambios. Si escribiese sólo «:q», Vim mostraría un mensaje de error y se negaría a salir:

source: E37: No write since last change (use ! to override) ~
es_es: E37: No se ha guardado el fichero desde el último cambio (añada ! para forzar) ~

source: *02.8* Finding help
es_es: *02.8* Encontrar ayuda

source: Everything you always wanted to know can be found in the Vim help files. Don't be afraid to ask! To get generic help use this command: >
es_es: Todo lo que quiera saber puede encontrarlo en los archivos de ayuda. ¡No tenga miedo a preguntar! Use la siguiente orden para obtener ayuda genérica:

source: You could also use the first function key <F1>. If your keyboard has a <Help> key it might work as well. If you don't supply a subject, ":help" displays the general help window. The creators of Vim did something very clever (or very lazy) with the help system: They made the help window a normal editing window. You can use all the normal Vim commands to move through the help information. Therefore h, j, k, and l move left, down, up and right. To get out of the help window, use the same command you use to get out of the editor: "ZZ". This will only close the help window, not exit Vim.
es_es: También puede usar la tecla <F1>. Si su teclado tiene tecla <Ayuda> puede que funcione también. Si no define un tema, «:help» muestra la ventana de ayuda general. Los creadores de Vim hicieron algo muy inteligente (o fueron muy vagos) con el sistema de ayuda: Hicieron la ventana de ayuda una ventana normal de edición. Puede usar todas las órdenes comunes de Vim para moverse por ella. Por lo tanto, h, j, k, l mueven el cursor hacia la izquierda, derecha, arriba y abajo. Para salir de la ventana de ayuda, usa la misma orden que usas para salir del editor: «ZZ». Esto sólo cierra la ayuda, no sale de Vim.

source: When you need to get help for a control character command (for example, CTRL-A), you need to spell it with the prefix "CTRL-". >
es_es: Cuando necesite obtener ayuda para las órdenes de control de carácter (por ejemplo, CTRL-A), debe escribirlo con el prefijo «CTRL-». >

source: The Vim editor has many different modes. By default, the help system displays the normal-mode commands. For example, the following command displays help for the normal-mode CTRL-H command: >
es_es: El editor Vim tiene muchos modos diferentes. De manera predeterminada, el sistema de ayuda muestra las ordenes del modo normal. Por ejemplo, la siguiente orden muestra la ayuda para la orden CTRL-H en modo normal: >

source: To identify other modes, use a mode prefix. If you want the help for the insert-mode version of a command, use "i_". For CTRL-H this gives you the following command: >
es_es: Para identificar otros modos, se necesita un prefijo de modo. Si quiere ayuda para la versión en modo Insertar de una orden, use «i_». Para, CTRL-H es la siguiente orden: >

source: The Vim editor has a number of options that enable you to configure and customize the editor. If you want help for an option, you need to enclose it in single quotation marks. To find out what the 'number' option does, for example, use the following command: >
es_es: El editor Vim tiene una serie de opciones que le permiten configurar y personalizar el editor. Si quiere ayuda para una opción, tiene que escribirla entre comillas simples. Para encontrar lo que hace la opción 'number' por ejemplo, usa la orden siguiente: >

source: Special keys are enclosed in angle brackets. To find help on the up-arrow key in Insert mode, for instance, use this command: >
es_es: Las teclas especiales se escriben entre corchetes angulares. Para encontrar ayuda sobre la flecha hacia arriba en modo insertar, use: >

source: *intro.txt* For Vim version 7.3. Last change: 2010 Jul 20
es_es: *intro.esx* Para Vim versión 7.3. Último cambio: 24/6/2008

source: VIM REFERENCE MANUAL by Bram Moolenaar
es_es: MANUAL DE REFERENCIA DE VIM por Bram Moolenar

source: Introduction to Vim *ref* *reference*
es_es: Introducción a Vim *ref* *referencia* *reference*

source: 1. Introduction |intro| 2. Vim on the internet |internet| 3. Credits |credits| 4. Notation |notation| 5. Modes, introduction |vim-modes-intro| 6. Switching from mode to mode |mode-switching| 7. The window contents |window-contents| 8. Definitions |definitions|
es_es: 1. Introducción |intro| 2. Vim en internet |internet| 3. Créditos |credits| 4. Notación |notación| |notation| 5. Modos, introducción |vim-modes-intro| 6. Cambiar de Modos |cambiar-modo| |mode-switching| 7. El contenido de la ventana |ventana-contenidos| |window-contents| 8. Definiciones |definiciones| |definitions|

source: 1. Introduction *intro*
es_es: 1. Introducción *intro*
